src/src/Catalogs/EstimatesTemplates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>EstimatesTemplates</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Products</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Specification</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BillsOfMaterials</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Expenses</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Expense</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CalculationMethod</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CostsAmountCalculationMethods</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/Enums/CostsAmountCalculationMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>CostsAmountCalculationMethods</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FixedAmount</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PercentageSalesAmount</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PercentageProfit</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Catalogs/EstimatesTemplates/Ext/ObjectModule.bsl
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	PresentationCurrency = GetFunctionalOption("ForeignExchangeAccounting");
	AccountCurrency = Constants.PresentationCurrency.Get();
	Errors = Undefined;
	
	For Each Line In Expenses Do
		If Line.CalculationMethod = Enums.CostsAmountCalculationMethods.FixedAmount AND Not ValueIsFilled(Line.Currency) Then
			If PresentationCurrency Then
				LineIndex = Expenses.IndexOf(Line);
				CommonUseClientServer.AddUserError(
					Errors, 
					"Expenses.Currency",,
					"Expenses.Currency",
					LineIndex,
					NStr("en = 'Not specified currency in line %1'"),
					LineIndex);
			Else
				Line.Currency = AccountCurrency;
			EndIf; 
		EndIf; 
	EndDo;
	
	If Not Errors = Undefined Then
		CommonUseClientServer.ShowErrorsToUser(Errors, Cancel);
	EndIf; 
	
EndProcedure

Procedure BeforeWrite(Cancel)
	
	// Update requisite ConnectionKey
	
	ConnectionKey = 0;
	For Each Line In Inventory Do
		ConnectionKey = Max(ConnectionKey, Line.ConnectionKey); 
	EndDo; 
	For Each Line In Expenses Do
		ConnectionKey = Max(ConnectionKey, Line.ConnectionKey); 
	EndDo;
	
	For Each Line In Inventory Do
		If Line.ConnectionKey=0 Then
			ConnectionKey = ConnectionKey + 1;
			Line.ConnectionKey = ConnectionKey;
		EndIf; 
	EndDo; 
	For Each Line In Expenses Do
		If Line.ConnectionKey = 0 Then
			ConnectionKey = ConnectionKey + 1;
			Line.ConnectionKey = ConnectionKey;
		EndIf; 
	EndDo; 
	
EndProcedure
